<a href="https://colab.research.google.com/github/annachristen/DA-Class-Notes-and-projects/blob/main/Library_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [27]:
import pandas as pd
df = pd.read_csv('Public_Libraries - updated.csv')

In [28]:
df.head(10)
df.info(5)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5105 entries, 0 to 5104
Data columns (total 29 columns):
 #   Column                                              Non-Null Count  Dtype
---  ------                                              --------------  -----
 0   Fiscal Year                                         5105 non-null   int64
 1   Library                                             5105 non-null   object
 2   County                                              5105 non-null   object
 3   Principal Public?                                   5105 non-null   object
 4   AENGLC Rank                                         4988 non-null   float64
 5   Population of Service Area                          4642 non-null   float64
 6   Total Library Visits                                4886 non-null   float64
 7   Library Visits Per Capita Served                    4870 non-null   float64
 8   Total Registered Borrowers                          5000 non-null   float64
 9   Percent of Residents with Library Cards             4986 non-null   float64
 10  Registrations Per Capita Served                     0 non-null      float64
 11  Reference Questions                                 4709 non-null   float64
 12  Reference Questions Per Capita Served               4680 non-null   float64
 13  Total Circulation                                   5052 non-null   float64
 14  Circulation Per Capita Served                       5035 non-null   float64
 15  Total Programs (Synchronous + Prerecorded)          4937 non-null   float64
 16  Total Program Attendance & Views                    4914 non-null   float64
 17  Total Program Attendance & Views Per Capita Served  4892 non-null   float64
 18  Use of Public Internet Computers                    3184 non-null   float64
 19  Total Collection                                    5028 non-null   float64
 20  Collection Per Capita Served                        4977 non-null   float64
 21  Total Operating Income                              5042 non-null   object
 22  Operating Income Per Capita                         4998 non-null   object
 23  Town Tax Appropriation for Library                  5032 non-null   object
 24  Tax Appropriation Per Capita Served                 4987 non-null   object
 25  Library Materials Expenditures                      5022 non-null   object
 26  Wages & Salaries Expenditures                       4951 non-null   object
 27  Operating Expenditures                              5038 non-null   object
 28  Operating Expenditures Per Capita                   5007 non-null   object
dtypes: float64(17), int64(1), object(11)
memory usage: 1.1+ MB

In [29]:
df['Operating Expenditures Per Capita']
df['Fiscal Year']
df['County']

0          Tolland
1        New Haven
2          Windham
3         Hartford
4        New Haven
           ...
5100    Litchfield
5101       Windham
5102       Windham
5103       Windham
5104       Windham
Name: County, Length: 5105, dtype: object

In [30]:
df = df.drop('Registrations Per Capita Served', axis=1)
df = df.drop('Use of Public Internet Computers', axis=1)

In [40]:
df.info(20)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5105 entries, 0 to 5104
Data columns (total 27 columns):
 #   Column                                              Non-Null Count  Dtype
---  ------                                              --------------  -----
 0   Fiscal Year                                         5105 non-null   int64
 1   Library                                             5105 non-null   object
 2   County                                              5105 non-null   object
 3   Principal Public?                                   5105 non-null   object
 4   AENGLC Rank                                         4988 non-null   float64
 5   Population of Service Area                          4642 non-null   float64
 6   Total Library Visits                                4886 non-null   float64
 7   Library Visits Per Capita Served                    4870 non-null   float64
 8   Total Registered Borrowers                          5000 non-null   float64
 9   Percent of Residents with Library Cards             4986 non-null   float64
 10  Reference Questions                                 4709 non-null   float64
 11  Reference Questions Per Capita Served               4680 non-null   float64
 12  Total Circulation                                   5052 non-null   float64
 13  Circulation Per Capita Served                       5035 non-null   float64
 14  Total Programs (Synchronous + Prerecorded)          4937 non-null   float64
 15  Total Program Attendance & Views                    4914 non-null   float64
 16  Total Program Attendance & Views Per Capita Served  4892 non-null   float64
 17  Total Collection                                    5028 non-null   float64
 18  Collection Per Capita Served                        4977 non-null   float64
 19  Total Operating Income                              5042 non-null   object
 20  Operating Income Per Capita                         4998 non-null   object
 21  Town Tax Appropriation for Library                  5032 non-null   object
 22  Tax Appropriation Per Capita Served                 4987 non-null   object
 23  Library Materials Expenditures                      5022 non-null   object
 24  Wages & Salaries Expenditures                       4951 non-null   object
 25  Operating Expenditures                              5038 non-null   object
 26  Operating Expenditures Per Capita                   5007 non-null   object
dtypes: float64(15), int64(1), object(11)
memory usage: 1.1+ MB

In [37]:
df['County'].value_counts()

County
Hartford      887
New Haven     811
Fairfield     737
Litchfield    719
New London    578
Windham       544
Middlesex     465
Tolland       364
Name: count, dtype: int64

In [39]:
df['Fiscal Year'].value_counts()

Fiscal Year
2000    185
2002    184
2003    184
2001    183
2006    183
2017    183
2018    183
2019    183
2012    183
2013    183
2014    183
2015    183
2020    183
2021    183
2022    183
2023    183
2016    183
2011    182
2004    182
2005    182
2010    182
2009    182
1996    181
2007    181
2008    181
1998    179
1999    179
1997    179
Name: count, dtype: int64

In [38]:
df['Library'].value_counts()

Library
Andover                         28
Ashford-Babcock                 28
Avon                            28
Beacon Falls                    28
Bethany - Clark                 28
                                ..
East Windsor - Broad             1
Plainfield - Central Village     1
Pomfret - Abington               1
Litchfield - Gilbert             1
Derby-Derby Neck                 1
Name: count, Length: 208, dtype: int64

In [41]:
df['Principal Public?'].value_counts()

Principal Public?
P    4617
N     488
Name: count, dtype: int64

In [42]:
df.info(20)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5105 entries, 0 to 5104
Data columns (total 27 columns):
 #   Column                                              Non-Null Count  Dtype
---  ------                                              --------------  -----
 0   Fiscal Year                                         5105 non-null   int64
 1   Library                                             5105 non-null   object
 2   County                                              5105 non-null   object
 3   Principal Public?                                   5105 non-null   object
 4   AENGLC Rank                                         4988 non-null   float64
 5   Population of Service Area                          4642 non-null   float64
 6   Total Library Visits                                4886 non-null   float64
 7   Library Visits Per Capita Served                    4870 non-null   float64
 8   Total Registered Borrowers                          5000 non-null   float64
 9   Percent of Residents with Library Cards             4986 non-null   float64
 10  Reference Questions                                 4709 non-null   float64
 11  Reference Questions Per Capita Served               4680 non-null   float64
 12  Total Circulation                                   5052 non-null   float64
 13  Circulation Per Capita Served                       5035 non-null   float64
 14  Total Programs (Synchronous + Prerecorded)          4937 non-null   float64
 15  Total Program Attendance & Views                    4914 non-null   float64
 16  Total Program Attendance & Views Per Capita Served  4892 non-null   float64
 17  Total Collection                                    5028 non-null   float64
 18  Collection Per Capita Served                        4977 non-null   float64
 19  Total Operating Income                              5042 non-null   object
 20  Operating Income Per Capita                         4998 non-null   object
 21  Town Tax Appropriation for Library                  5032 non-null   object
 22  Tax Appropriation Per Capita Served                 4987 non-null   object
 23  Library Materials Expenditures                      5022 non-null   object
 24  Wages & Salaries Expenditures                       4951 non-null   object
 25  Operating Expenditures                              5038 non-null   object
 26  Operating Expenditures Per Capita                   5007 non-null   object
dtypes: float64(15), int64(1), object(11)
memory usage: 1.1+ MB

In [43]:
df['AENGLC Rank'].value_counts()

AENGLC Rank
1.0      50
168.0    40
167.0    40
109.0    38
39.0     37
         ..
89.0     25
120.0    25
147.0    25
75.0     25
90.0     24
Name: count, Length: 169, dtype: int64

In [44]:
df['Total Circulation'].value_counts()

Total Circulation
0.0         11
89737.0      3
539660.0     3
5400.0       3
6785.0       3
            ..
300374.0     1
18852.0      1
77080.0      1
159701.0     1
36160.0      1
Name: count, Length: 4964, dtype: int64